/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名   : ComM_Cfg.h
* 功能描述 : 通讯管理模块配置头文件
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2017/5/8         chenms             New
**------------------------------------------------------------------------------------------------*/
#ifndef  _COMM_CFG_H_
#define  _COMM_CFG_H_

/**************************************
              	头文件
 **************************************/
#include "Std_Types.h"
#include "Modules.h"


/**************************************
             	宏定义
 **************************************/
#define   COMM_DEV_ERROR_DETECT   (STD_ON)    /*开发时错误检测*/
#define   COMM_SUPPORT_GROUPNUM   (1u)         /*模块支持的冗余组数量,注:该值应与ComM_Cfg.c中的配置项NumOfComMGroup数值一致*/


#endif

