/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名    : drv_ect.h
* 功能描述  : 9s12xep100-drv_ect驱源文件(drv_ect.h)
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2019/1/3         sunj                New
**------------------------------------------------------------------------------------------------*/
#ifndef _DRV_ECT_H_
#define _DRV_ECT_H_

#include "Ect.h"

extern void Drv_Ect_Init(void); 


#endif