#if  0
/***********************************************************************************************//*!
 * \file
 * \brief 中间层程序.h文件
 * \version 0.1.1
 * \date 2013.01.24
 *
 * 中间层程序.h文件
 *
 \verbatim
  --------------------------Copyright (c)成都运达科技股份有限公司---------------------------------
 File name: cmd.h
              +----- (NEW | MODify | ADD | DELete)
              |
  ver         |   date(yy/mm/dd)  name               descant
 ----------+----+---------------+-----------+-----------------------------------------------------
  0.1.0      NEW  2012/08/10      段云波      初始版本
 -------------------------------------------------------------------------------------------------
 \endverbatim
 **************************************************************************************************/

#ifndef MDE_H
#define MDE_H

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "mde_cmd.h"

#endif /* #ifndef MDE_H */

#endif

