/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名        : Compile.h
* 功能描述      : 编译器相关宏定义头文件(.h)
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2015/10/27       chenms             重构
**------------------------------------------------------------------------------------------------*/
#ifndef  _Compile_CFG_H_
#define  _Compile_CFG_H_


#define  STATIC   static  
#define  CONST    const




#endif