/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名   : CanIf_Cfg.h
* 功能描述 : CanIf模块配置头文件
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2017/4/27       chenms              New
**------------------------------------------------------------------------------------------------*/
#ifndef  _CANIF_CFG_H_
#define  _CANIF_CFG_H_

/**************************************
              	头文件
 **************************************/
#include "Std_Types.h"
#include "Modules.h"

/**************************************
             		宏定义
 **************************************/
#define   CANIF_DEV_ERROR_DETECT   	(STD_ON)   	/*开发时错误检测*/
#define   CANIF_CONTROLLER_NUM 		(2u)    	/*模块支持CAN控制器数量*/

#define   CANIF_CONTROLLER_ISRTXTICKS (5ul)     /*控制器中断发送跟踪超时时间,单位:Ticks*/
#endif




