/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名        : Osal.c
* 功能描述      : OS抽象层源文件(.h)定义
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2016/1/7      chenms             NEW
**------------------------------------------------------------------------------------------------*/
#ifndef  _OSAL_H_
#define  _OSAL_H_

#include "Std_Types.h"
#include <ucos_ii.h>
/********************************************/
#define  OSALTimeGet()    OSTimeGet()

extern  void  OSAL_ENTER_CRITICAL(void );
extern  void  OSAL_EXIT_CRITICAL(void);





#endif
