/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名        : Osal.c
* 功能描述      : OS抽象层源文件(.c)定义
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2016/1/7      chenms             NEW
**------------------------------------------------------------------------------------------------*/

#include "Osal.h"

/*******************************************/
#pragma DATA_SEG __GPAGE_SEG  LARGER_RAM
STATIC volatile  OS_CPU_SR  OSAL_Cpu_Sr[256] = {0u};  /*该版本暂时只支持256级嵌套*/
STATIC volatile  INT8U      OSAL_IntNesting  = 0u;   
#pragma DATA_SEG DEFAULT

/************************************************************
* 函数名称: OSAL_ENTER_CRITICAL()
* 函数描述: OS抽象层进入临界段;
* 输入参数: 无
* 输出参数: 无
* 输入/输出参数:无
* 可重入性: 不可重入
* 返回值  : 无 
* 备注	  :
*************************************************************/
void  OSAL_ENTER_CRITICAL(void )
{   
	if(OSAL_IntNesting < 255u)
	{
		OSAL_IntNesting++; /*1,2..255*/
  		OSAL_Cpu_Sr[OSAL_IntNesting] = OS_CPU_SR_Save(); 
	}	
}

/************************************************************
* 函数名称: OSAL_EXIT_CRITICAL()
* 函数描述: OS抽象层退出临界段;
* 输入参数: 无
* 输出参数: 无
* 输入/输出参数:无
* 可重入性: 不可重入
* 返回值  : 无 
* 备注	  :
*************************************************************/
void  OSAL_EXIT_CRITICAL(void)
{  
	if(OSAL_IntNesting > 0u)
	{
  		OS_CPU_SR_Restore(OSAL_Cpu_Sr[OSAL_IntNesting]);
		OSAL_IntNesting--;
	}
}
































