/****************************************Copyright (c)**********************************************
**                                   成都运达科技股份公司
* 文件名   : Com_Cfg.h
* 功能描述 : 通讯模块配置头文件(Com_Cfg.h)
*
*            +----- (NEW | MODify | ADD | DELete)
*            |
* 版本       |    日期         姓名               版本描述
*----------+---+------------+------------------+----------------------------------------------------
* 1.0.0       2017/5/25       chenms            	  New
**------------------------------------------------------------------------------------------------*/
#ifndef  _COM_CFG_H_
#define  _COM_CFG_H_

/**************************************
              	头文件
 **************************************/
#include "Std_Types.h"
#include "Modules.h"

/**************************************
             	宏定义
 **************************************/
#define   COM_DEV_ERROR_DETECT   	(STD_ON)    	/*开发时错误检测*/

#define   COM_MAX_PROTOCOLNUM   	(1u)        	/*模块支持的协议个数,该参数不能比配置参数NumOfProtocol小,但可以>=NumOfProtocol*/
#define   COM_MAX_IPDUNUM 			(3u)        	/*模块支持的协议中,单个协议支持的最大报文数量(接收+发送),该参数不能比配置参数NumOfIPdu值小,但可以>=NumOfIPdu*/      

/*************/
/*协议包含报文类型定义*/
/**********************信号采集板**********************/
#define   COM_SIGCOLBOARD_COl		(0x01000000ul)	/*信号采集板采集报文*/
#define	  COM_GPKZX_STATEMONI       (0x04000000ul)  /*轨旁控制箱状态监测报文*/
#define   COM_BOARD_INFO			(0x05000000ul)  /*板卡信息报文*/


#endif




